### row / column 추가

In [3]:
import pandas as pd

In [4]:
data = [
    ["3R", 1510, 7.36],
    ["3SOFT", 1790, 1.65],
    ["ACTS", 1185, 1.28]
]

index = ["037730", "036360", "005760"]
columns = ["종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df

          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

### add row

In [5]:
# df.loc['005760'] , update
df.loc['005760', :]

종목명    ACTS
현재가    1185
등락률    1.28
Name: 005760, dtype: object

In [6]:
df.loc['066570'] = ['LG전자', 100000, 1.23]
df

          종목명     현재가   등락률
037730     3R    1510  7.36
036360  3SOFT    1790  1.65
005760   ACTS    1185  1.28
066570   LG전자  100000  1.23

### add column

In [7]:
# 괴리율이라는 column 추가 insert

df['괴리율'] = [1.23, 1.23, 1.23, 1.23]
df

          종목명     현재가   등락률   괴리율
037730     3R    1510  7.36  1.23
036360  3SOFT    1790  1.65  1.23
005760   ACTS    1185  1.28  1.23
066570   LG전자  100000  1.23  1.23

In [8]:
# 목표가라는 column 추가 insert 없기에

# df['목표가'] = [1600, 1600, 1600, 1600]
df['목표가'] = [1600] * len(df)
df

          종목명     현재가   등락률   괴리율   목표가
037730     3R    1510  7.36  1.23  1600
036360  3SOFT    1790  1.65  1.23  1600
005760   ACTS    1185  1.28  1.23  1600
066570   LG전자  100000  1.23  1.23  1600

In [9]:
# update (목표가 - 현재가 / 현재가)
df['괴리율'] = (df['목표가'] - df['현재가']) / df['현재가']
df

          종목명     현재가   등락률       괴리율   목표가
037730     3R    1510  7.36  0.059603  1600
036360  3SOFT    1790  1.65 -0.106145  1600
005760   ACTS    1185  1.28  0.350211  1600
066570   LG전자  100000  1.23 -0.984000  1600

### merge

In [11]:
data = {
    '종가': [113000, 111500],
    '거래량': [555850, 282163]
}

index = ["2019-06-21", "2019-06-20"]
df_first = pd.DataFrame(data=data, index=index)

data = {
    '시가': [112500, 110000],
    '고가': [115000, 112000],
    '저가': [111500, 109000]
}

index = ["2019-06-20", "2019-06-19"]
df_second = pd.DataFrame(data=data, index=index)

물어바 방식

db에서 쿼리와 비슷

numpy의 합체는 concat > 블록 옆에 붙이는거와 같음 > 높이와 가로가 같아야함 > 같아야하는 곳은 행 열이 서로 반대임

In [14]:
df_first.shape, df_second.shape

((2, 2), (2, 3))

In [19]:
# 열 머지
# pd.concat([df_first, df_second], axis=1)
# pd.concat([df_first, df_second], axis=1, join='inner')
pd.concat([df_first, df_second], axis=1, join='outer')

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [21]:
pd.concat([df_first, df_second], axis=1)

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

In [23]:
pd.concat([df_first, df_second], axis=0, join='outer') # axis=0 > 행끼리 붙이기 > 가로(컬럼)가 같아야함

                  종가       거래량        시가        고가        저가
2019-06-21  113000.0  555850.0       NaN       NaN       NaN
2019-06-20  111500.0  282163.0       NaN       NaN       NaN
2019-06-20       NaN       NaN  112500.0  115000.0  111500.0
2019-06-19       NaN       NaN  110000.0  112000.0  109000.0

### Merge()

In [24]:
# 첫 번째 데이터프레임
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["전기전자", "000660", "SK하이닉스", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df_third = pd.DataFrame(data=data, columns=columns)

# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["업종", "등락률"]
df_fourth = pd.DataFrame(data=data, columns=columns)

In [25]:
df_third.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   업종      3 non-null      object
 1   종목코드    3 non-null      object
 2   종목명     3 non-null      object
 3   현재가     3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

In [26]:
df_fourth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   업종      4 non-null      object
 1   등락률     4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 196.0+ bytes

In [27]:
df_third

     업종    종목코드     종목명     현재가
0  전기전자  005930    삼성전자   74400
1    화학  051910    LG화학  896000
2  전기전자  000660  SK하이닉스  101500

In [28]:
df_fourth

     업종   등락률
0    은행  2.92
1    보험  0.37
2    화학  0.06
3  전기전자 -2.43

In [ ]:
# pd.merge(left=df_third, right=df_fourth, on='업종') inner는 생략가능
pd.merge(left=df_third, right=df_fourth, on='업종', how='inner')

     업종    종목코드     종목명     현재가   등락률
0  전기전자  005930    삼성전자   74400 -2.43
1    화학  051910    LG화학  896000  0.06
2  전기전자  000660  SK하이닉스  101500 -2.43

In [31]:
pd.merge(left=df_third, right=df_fourth, on='업종', how='outer')

     업종    종목코드     종목명       현재가   등락률
0    보험     NaN     NaN       NaN  0.37
1    은행     NaN     NaN       NaN  2.92
2  전기전자  005930    삼성전자   74400.0 -2.43
3  전기전자  000660  SK하이닉스  101500.0 -2.43
4    화학  051910    LG화학  896000.0  0.06

In [32]:
pd.merge(left=df_fourth, right=df_third, on='업종', how='outer')

     업종   등락률    종목코드     종목명       현재가
0    보험  0.37     NaN     NaN       NaN
1    은행  2.92     NaN     NaN       NaN
2  전기전자 -2.43  005930    삼성전자   74400.0
3  전기전자 -2.43  000660  SK하이닉스  101500.0
4    화학  0.06  051910    LG화학  896000.0

In [33]:
pd.merge(left=df_fourth, right=df_third, on='업종', how='inner')

     업종   등락률    종목코드     종목명     현재가
0    화학  0.06  051910    LG화학  896000
1  전기전자 -2.43  005930    삼성전자   74400
2  전기전자 -2.43  000660  SK하이닉스  101500